//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
//**                                                             **//
//**         (C)Copyright 2016, American Megatrends, Inc.        **//
//**                                                             **//
//**                     All Rights Reserved.                    **//
//**                                                             **//
//**   5555 Oakbrook Pkwy, Building 200,Norcross, Georgia 30093  **//
//**                                                             **//
//**                     Phone (770)-246-8600                    **//
//**                                                             **//
//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
// $Archive: $
//
// $Author: $
//
// $Revision: $
//
// $Date: $
//
//*****************************************************************//
//*****************************************************************//
// Revision History
// ----------------
// $Log:  $
// 
//**********************************************************************

//new string add the token in FirmwareNwConfigDrvFakeTokens.c


#langdef   en-US "English"    // English
#langdef   zh-chs "中文 " // Chinese simplified
//<kuaibai002-20181222-Improvement of OOB string prompt +>
// #string STR_CONFIGURE_FW               #language en-US "Configuring firmware is in progress..."
#string STR_CONFIGURE_FW                  #language en-US "Preparing BIOS Redfish interface..."
                                          #language zh-chs "准备BIOS Redfish接口"
#string STR_SERVER_IP                     #language en-US "Connecting server IP: "
                                          #language zh-chs "连接服务器IP："
#string STR_RESPONSE                      #language en-US " Response: "
                                          #language zh-chs "响应："
#string STR_SUCCESS                       #language en-US "Success"
                                          #language zh-chs "成功"
#string STR_TIME_OUT                      #language en-US "Time out"
                                          #language zh-chs "超时"
// #string STR_CONFIGURE_FW_FAILED        #language en-US "Configuring firmware failed..."
#string STR_CONFIGURE_FW_FAILED           #language en-US "Preparing failed..."
                                          #language zh-chs "准备失败..."
#string STR_LOADING_DEFAULT               #language en-US "Loading defaults..."
                                          #language zh-chs "加载默认值..."
// #string STR_ATTRIB_REG             	  #language en-US "Pushing firmware layout to OData server."
#string STR_ATTRIB_REG                    #language en-US "Pushing BIOS SETUP database to BMC..."
                                          #language zh-chs "推送BIOS SETUP数据至BMC..."
// #string STR_INDEX_JSON                 #language en-US "Pushing current configuration to OData server."
#string STR_INDEX_JSON                    #language en-US "Pushing BIOS current settings to BMC..."
                                          #language zh-chs "推送BIOS当前设定至BMC..."
// #string STR_IMPORTING_FWCONFIG         #language en-US "Importing firmware configuration settings from OData server."
#string STR_IMPORTING_FWCONFIG            #language en-US "Importing BIOS settings from BMC if any..."
                                          #language zh-chs "从BMC导入BIOS设置"
// #string STR_IMPORTING_PASSWORD         #language en-US "Importing password."
#string STR_IMPORTING_PASSWORD            #language en-US "Importing BIOS password from BMC if any..."
                                          #language zh-chs "从BMC导入BIOS密码"
// #string STR_UI_APP_FILES               #language en-US "Pushing UI App files to OData server."
#string STR_UI_APP_FILES                  #language en-US "Pushing UI App files to BMC..."
                                          #language zh-chs "推送UI App文件到BMC..."
#string STR_ERASE_LINE                    #language en-US "                                                                                "
                                          #language zh-chs "                                                                                "
//<kuaibai002-20181222-Improvement of OOB string prompt ->
